backend/app/controllers/buttons_controller.rb

  def index
    buttons = Button.all.map { |button| button.as_json }
---
SELECT "buttons".* FROM "buttons"

  def create
    button = Button.new(button_params)

    if button.save!
---
INSERT INTO "buttons" ("text", "colour_h", "colour_s", "colour_l", "width", "height", "position", "click_through_delta", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"