backend/app/controllers/models_controller.rb

  def mobile
    mobile_models = Model.mobile.map { |mobile_model| mobile_model.as_json }
---
SELECT "models".* FROM "models" WHERE "models"."mobile" = $1  [["mobile", true]]